# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4

# task 05 == виправте назви змінних
first_storona = 1
second_storona = 2
third_storona = 3
fourth_storona = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = first_storona + second_storona + third_storona + fourth_storona
print("Периметр фігури = ", perimetery)


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apples = 4 #4 яблуні
peers = apples + 5 #тобто груш на 5 більше ніж яблунь
plums = apples - 2 #а слив на 2 менше ніж яблунь
count = apples + peers + plums #порахували скільки всього дерев посадили
print("Всього було посаджено ", count, " дерев") #виводимо відповідь на екран
# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
morning_temp = 5 #температура до обіду
pastmidday_temp = morning_temp - 10 #температура після обіду - на 10 градусів менша ніж зранку
evening_temp = pastmidday_temp + 4 #температура надвечір - на 4 градуси більша ніж після обіду
print("Температура надвечір ", evening_temp, " градусів") #виводимо відповідь на екран
# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys = 24 #кількість хлопчиків
girls = int(boys / 2) #кількість дівчат - вполовину менша ніж хлопців
children_count = boys + girls - 3 #рахуємо кількість присутніх дітей
print("Сьогодні на гурток прийшло ", children_count, " дітей") #виводимо відповідь на екран
# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
first_book = 8 #вартість першої книжки
second_book = first_book + 2 #вартість другої книжки - на дві грн. дорожче ніж першої
third_book = (first_book + second_book) / 2 #вартість третьої книжки - половина вартості першої та другої
price = first_book + second_book + third_book #рахуємо вартість усіх книг, якщо купити по одному примірнику
print("Вартість трьох книжок ", price, " грн.") #виводимо відповідь на екран

