# Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
# [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і
# вивести “Не можу це зробити!”
# Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
# Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”

def digits_item_sum(lst):
    result = []
    for item in lst:
        try:
            numbers = item.split(',')
            total = sum([int(num) for num in numbers])
            result.append(total)
        except ValueError:
            result.append("Не можу це зробити!")
    return result

test_list = ['1,2,3,4', '1,2,3,4,50', 'qwerty1,2,3']
print(digits_item_sum(test_list))